Repository: j-janczak/eInkPhotoConverter
Catalog: src/locale/*/LC_MESSAGES/messages.po
Languages: pl

source: Unable to open
pl: Nie można otworzyć pliku

source: Unable to save
pl: Nie można zapisać pliku

source: Creating thumbnails...
pl: Tworzenie miniatur…

source: Selected photos
pl: Wybrane zdjęcia

source: Select photos
pl: Wybierz zdjęcia

source: Image files
pl: Pliki graficzne

source: You can select a maximum of 100 files
pl: Można wybrać maksymalnie 100 plików

source: Convert settings
pl: Ustawienia konwersji

source: Dithering algorithm
pl: Algorytm ditheringu

source: None
pl: Brak

source: Transform mode
pl: Metoda przekształcania

source: Crop
pl: Przytnij

source: Fit
pl: Dopasuj

source: Stretch
pl: Rozciągnij

source: App language (Requires app restart)
pl: Język aplikacji (Wymaga restartu)

source: Credits
pl: Podziękowania

source: About
pl: O programie

source: The "eInk Photo Converter" program converts photos into 24-bit BMP files with a resolution of 800x480, utilizing a 7-color palette. Photos in this format are suitable for display on the PhotoPainter device from WaveShare.
pl: Program “eInk Photo Converter” konwertuje zdjęcia na 24-bitowe pliki BMP o rozdzielczości 800x480, wykorzystując paletę 7 kolorów. Zdjęcia w tym formacie nadają się do wyświetlania na urządzeniu PhotoPainter od firmy WaveShare.

source: Dithering algorithm settings:
pl: Ustawienia algorytmu ditheringu:

source: None - does not apply a dithering algorithm; for each pixel of the image, the most fitting color from the seven-color palette is chosen.
pl: Brak - nie stosuje algorytmu ditheringu; dla każdego piksela obrazu wybierany jest najbardziej pasujący kolor z palety siedmiu kolorów.

source: Floyd-Steinberg - Simulate greater color depth with a limited palette. It distributes the quantization error of a pixel to its neighboring pixels, allowing for smoother color transitions. (Recommend)
pl: Floyd-Steinberg - Symuluje większą głębię kolorów przy użyciu ograniczonej palety. Rozprowadza błąd kwantyzacji piksela na sąsiednie piksele, co pozwala na płynniejsze przejścia kolorów. (Polecane)

source: Transform mode settings:
pl: Metody przszkształcania:

source: Crop - If the image has different proportions than the target size, it is cropped to fill the entire available space. This may result in trimmed edges.
pl: Przytnij - Jeżeli obraz ma inne proporcje niż docelowy rozmiar, zostaje przycięty tak, aby wypełnić całą dostępną przestrzeń. Może to skutkować przycięciem krawędzi.

source: Fit - If the image has different proportions than the target size, it is scaled down while maintaining its aspect ratio to fit within the specified dimensions. If the proportions differ from the target dimensions, empty spaces are filled with a white background.
pl: Dopasuj - Jeżeli obraz ma inne proporcje niż docelowy rozmiar, jest zmniejszany z zachowaniem proporcji tak, aby cały zmieścił się w zadanych wymiarach. Jeżeli proporcje są inne niż w docelowych wymiarach, puste przestrzenie zostają wypełnione białym tłem.

source: Stretch - If the image has different proportions than the target size, it is stretched to fill the entire available space. This results in distortion of the image.
pl: Rozciągnij - Jeżeli obraz ma inne proporcje niż docelowy rozmiar, zostaje rozciągnięty, aby wypełnić całą dostępną przestrzeń. Powoduje to zniekształcenie obrazu.

source: No files selected
pl: Nie wybrano plików

source: Save location not selected
pl: Nie wybrano lokalizacji zapisu

source: Converting...
pl: Konwertowanie…

source: Image conversion completed successfully!
pl: Konwersja zdjęć zakończona sukcesem!

source: There were errors converting some images
pl: Wystąpiły błędy podczas konwersji niektórych obrazów

source: Open folder
pl: Otwórz folder

source: Select a save location
pl: Wybierz folder zapisu

source: Help
pl: Pomoc

source: Convert!
pl: Konwertuj!
